benchmark-results/round-3-intel/smade - 10 - 2.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      6468798.69          ---          ---         0.23128         0.23100         0.28700         0.31100         0.47100         0.61500         1.04700         1.21500         1.66300        47.10300    428867.52 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    6468798.69         0.00         0.00         0.23128         0.23100         0.28700         0.31100         0.47100         0.61500         1.04700         1.21500         1.66300        47.10300    428867.52 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       786377.73          ---          ---         0.20362         0.20700         0.24700         0.26300         0.37500         0.50300         0.61500         0.68700         0.88700         2.09500     52215.60 
Gets      7863690.78     43821.61   7819869.17         0.20354         0.20700         0.24700         0.26300         0.37500         0.50300         0.61500         0.69500         0.88700         2.09500    315740.25 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    8650068.51     43821.61   7819869.17         0.20355         0.20700         0.24700         0.26300         0.37500         0.50300         0.61500         0.69500         0.88700         2.09500    367955.84 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       111648.17          ---          ---         0.16741         0.16700         0.19900         0.20700         0.23900         0.40700         0.53500         0.63900         0.87900         1.51900      7413.34 
Gets      1116334.38      6581.99   1109752.39         0.16722         0.16700         0.19900         0.20700         0.23900         0.40700         0.52700         0.63100         0.84700         1.33500     44830.11 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1227982.55      6581.99   1109752.39         0.16724         0.16700         0.19900         0.20700         0.23900         0.40700         0.52700         0.63100         0.85500         1.51900     52243.45 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       753547.28          ---          ---         0.20844         0.21500         0.24700         0.25500         0.37500         0.50300         0.63100         0.74300         1.08700         4.67100     49958.69 
Gets      7535389.88   7535389.88         0.00         0.20839         0.21500         0.24700         0.25500         0.37500         0.50300         0.63100         0.73500         1.07900         4.67100    462786.22 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    8288937.15   7535389.88         0.00         0.20840         0.21500         0.24700         0.25500         0.37500         0.50300         0.63100         0.73500         1.07900         4.67100    512744.91 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       123351.73          ---          ---         0.16349         0.16700         0.19100         0.19900         0.23100         0.39900         0.53500         0.65500         0.98300         2.04700      8177.62 
Gets      1233354.51   1233354.51         0.00         0.16335         0.16700         0.19100         0.19900         0.23100         0.39900         0.52700         0.63900         0.86300         1.56700     75745.97 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1356706.24   1233354.51         0.00         0.16336         0.16700         0.19100         0.19900         0.23100         0.39900         0.52700         0.63900         0.87100         2.04700     83923.59